tutorials/incompressible/pimpleSolver/les/pitzDaily/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  SSGS;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  SSGS;
        tolerance       1e-06;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0;
    }
    U
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0;
    }

    kFinal
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0;
    }
    k
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0;
    }

    B
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0;
    }

    nuTilda
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
